from tifffile import imread, imsave
import matplotlib.pyplot as plt
import numpy as np
import os

# Това е кода, който написахме в петък:

# Прочитаме изображение от файл
img = imread(r"C:\Users\stamatov\Desktop\Lab\RPE1 1770\corrected/t1060.tif")

# Намираме всички сегментирани обекти 
all_labels = list(np.unique(img))

# Махаме фона от списъка
all_labels.remove(0)

# Намираме обема на обект с ID 31
mask = (img == label)
volume = np.sum(mask)

# Модифицирайте програмата, така че да намира обема на обект 22 във всички
# изображения в дадена папка.

# Жокер: за да получим списък от всички файлове в папка C:/Rumen/my_folder, използваме
# следното заклинание:
all_files = os.listdir(r"C:/Rumen/my_folder/")

# После, за да достъпите един файл, може да използвате:
img = imread(r"C:/Rumen/my_folder/" + filename)
# където filename е конкретен файл в тази папка.

# И така, в началото може да създадете празен списък, където да седят обемите и да
# обходите тези файлове с цикъл, например:
for filename in all_files:
    # и тук да напишете горния код, модифицирайки го, както е необходимо,
    # за да чете изображението от променливата на цикъла filename,
    # добавяйки обема на обект 22 към списъка.

# Накрая, може да направите графика, за да видим как се променя обема с времето.
# Успех!




